Tekla Open API Reference for Tekla Structures 2025
WorkPlaneHandler.GetCurrentTransformationPlane Method
 Gets the current transformation plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TransformationPlane GetCurrentTransformationPlane()
Public Function GetCurrentTransformationPlane As TransformationPlane
Return Value
Type: TransformationPlane
The current transformation plane.
See Also
Reference
WorkPlaneHandler Class
Tekla.Structures.Model Namespace